"""
Задача 5*

Проверить симметрична ли квадратная матрица относительно побочной диагонали. Дан список списков размера N × N.
Побочная диагональ — это диагональ, проходящая от верхнего правого угла к нижнему левому.
Вывести YES, если симметрична, иначе NO.

Примеры:

Дано: [
        [1, 2, 3],
        [4, 5, 2],
        [3, 4, 1]
    ] Результат: YES
Дано: [
        [7, 8, 9],
        [1, 5, 3],
        [9, 2, 7]
    ] Результат: NO
"""

matrix = [
        [1, 2, 3],
        [4, 5, 2],
        [3, 4, 1]
    ]

# matrix = [
#         [7, 8, 9],
#         [1, 5, 3],
#         [9, 2, 7]
#     ]

result = True

n = len(matrix)
for i in range(n):
    for j in range(n - 1 - i):
        if matrix[i][j] != matrix[n - 1 - j][n - 1 - i]:
            result = False

if result:
    print("YES")
else:
    print("NO")
